In [3]:
import pandas as pd

data = {
    'Name': ['Shah', 'Vats', 'Vats', 'Kumar', 'Vats', 'Kumar', 'Shah', 'Shah', 'Kumar', 'Vats'],
    'Gender': ['Male', 'Male', 'Female', 'Female', 'Female', 'Male', 'Male', 'Female', 'Female', 'Male'],
    'MonthlyIncome (Rs.)': [114000.00, 65000.00, 43150.00, 69500.00, 155000.00, 103000.00, 55000.00, 112400.00, 81030.00, 71900.00]
}

df = pd.DataFrame(data)

df

    Name  Gender  MonthlyIncome (Rs.)
0   Shah    Male             114000.0
1   Vats    Male              65000.0
2   Vats  Female              43150.0
3  Kumar  Female              69500.0
4   Vats  Female             155000.0
5  Kumar    Male             103000.0
6   Shah    Male              55000.0
7   Shah  Female             112400.0
8  Kumar  Female              81030.0
9   Vats    Male              71900.0

In [5]:
# a. Calculate and display familywise gross monthly income
family_gross_income = df.groupby('Name')['MonthlyIncome (Rs.)'].sum()
print("Familywise Gross Monthly Income:")
print(family_gross_income)

Familywise Gross Monthly Income:
Name
Kumar    253530.0
Shah     281400.0
Vats     335050.0
Name: MonthlyIncome (Rs.), dtype: float64

In [7]:
# b. Calculate and display the member with the highest monthly income in a family
member_highest_income = df.loc[df.groupby('Name')['MonthlyIncome (Rs.)'].idxmax()]
print("\nMember with the Highest Monthly Income in Each Family:")
print(member_highest_income)

Member with the Highest Monthly Income in Each Family:
    Name  Gender  MonthlyIncome (Rs.)
5  Kumar    Male             103000.0
0   Shah    Male             114000.0
4   Vats  Female             155000.0

In [9]:
income_above_60000 = df[df['MonthlyIncome (Rs.)'] > 60000.00]
print("\nMonthly Income of Members with Income > Rs. 60000.00:")
print(income_above_60000)

Monthly Income of Members with Income > Rs. 60000.00:
    Name  Gender  MonthlyIncome (Rs.)
0   Shah    Male             114000.0
1   Vats    Male              65000.0
3  Kumar  Female              69500.0
4   Vats  Female             155000.0
5  Kumar    Male             103000.0
7   Shah  Female             112400.0
8  Kumar  Female              81030.0
9   Vats    Male              71900.0

In [10]:
# d. Calculate and display the average monthly income of the female members in the Shah family
shah_female_avg_income = df[(df['Name'] == 'Shah') & (df['Gender'] == 'Female')]['MonthlyIncome (Rs.)'].mean()
print("\nAverage Monthly Income of Female Members in Shah Family:")
print(shah_female_avg_income)

Average Monthly Income of Female Members in Shah Family:
112400.0